Revit 2017 API
StructuralSectionISlopedFlange Class
 Defines parameters for I-shape Sloped Flange structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public class StructuralSectionISlopedFlange : StructuralSectionHotRolled
Visual Basic
Public Class StructuralSectionISlopedFlange _
	Inherits StructuralSectionHotRolled
Visual C++
public ref class StructuralSectionISlopedFlange : public StructuralSectionHotRolled
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISlopedFlange
See Also
StructuralSectionISlopedFlange Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace